Repository: Ananth-Desai/Flickr-App
Catalog: Flickr/Strings/*.lproj/Localizable.strings
Languages: fr

source: Search
fr: Rechercher

source: Favorites
fr: Favoris

# defaultText
source: Search for a photo and mark it as your favorite. Photos marked as favorites can be viewed offline.
fr: Recherchez une photo et marquez-lz comme votre favorite. Les photos marquées comme favorites peuvent être visualisées hors ligne.

# searchFieldPlaceholder
source: Search Flickr...
fr: Rechercher Flickr...

# searchButtonTitle
source: Search
fr: Rechercher

# searchScreenDefaultText
source: Find photos you like and save them by tapping heart icon.
fr: Trouvez des photos que vous aimez et enregistrez-les en appuyant sur l'icône en forme de cœur.

# searchErrorTitle
source: Error
fr: Erreur

# emptySearchString
source: The search string cannot be empty
fr: La chaîne de recherche ne peut être vide

# stringLengthInsufficientAlertTitle
source: The search string length must be greater than 2
fr: La longueur de la chaîne de recherche doit être supérieure à 2

# networkErrorString
source: Unable to make network call due to network error
fr: Impossible de passer un appel réseau en raison d'une erreur réseau

# noSearchResultsErrorString
source: No search results found
fr: Aucun résultat de recherche trouvé

# decodingErrorString
source: JSON Decoding Error
fr: Erreur de décodage JSON

source: Back
fr: Arrière
